import type { NextPage } from 'next'

const PrivacyPage: NextPage = () => {
    return (
        <>
            <main style={{
                'whiteSpace': 'pre-line',
                padding: '10px',
                color: '#000',
            }}
            >
                {`< 아이보 (Aivo) >('https://devcomma.com'이하 '아이보')은(는) 「개인정보 보호법」 제30조에 따라 정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리방침을 수립·공개합니다.

                       ○ 이 개인정보처리방침은 2023년 7월 9부터 적용됩니다.


                       제1조(개인정보의 처리 목적)

                < 아이보 (Aivo) >('https://devcomma.com'이하 '아이보')은(는) 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며 이용 목적이 변경되는 경우에는 「개인정보 보호법」 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.

                       1. 재화 또는 서비스 제공

                       앱 사용 서비스 제공을 목적으로 개인정보를 처리합니다.

                       제2조(개인정보의 처리 및 보유 기간)

                       ① < 아이보 (Aivo) >은(는) 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다.

                       ② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.

                       1.<재화 또는 서비스 제공>
                <재화 또는 서비스 제공>와 관련한 개인정보는 수집.이용에 관한 동의일로부터<준영구>까지 위 이용목적을 위하여 보유.이용됩니다.
                                                               보유근거 : 가입
                                                               관련법령 : 1)표시/광고에 관한 기록 : 6개월
                                                               2) 계약 또는 청약철회 등에 관한 기록 : 5년
                                                               3) 대금결제 및 재화 등의 공급에 관한 기록 : 5년
                                                               4) 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년
                                                               5) 신용정보의 수집/처리 및 이용 등에 관한 기록 : 3년
                                                               예외사유 :


                                                               제3조(처리하는 개인정보의 항목)

                                                               ① < 아이보 (Aivo) >은(는) 다음의 개인정보 항목을 처리하고 있습니다.

                                                               1< 재화 또는 서비스 제공 >
                        필수항목 : 이메일, 접속 로그, 서비스 이용 기록, 광고ID, Firebase 인증ID, 채팅기록
                        선택항목 :
                        
                        제4조(개인정보의 파기절차 및 파기방법)

                        ① < 아이보 (Aivo) > 은(는) 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.

                        ② 정보주체로부터 동의받은 개인정보 보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다.
                        1. 법령 근거 :
                        2. 보존하는 개인정보 항목 : 거래정보, 거래날짜

                        ③ 개인정보 파기의 절차 및 방법은 다음과 같습니다.
                        1. 파기절차
                        < 아이보 (Aivo) > 은(는) 파기 사유가 발생한 개인정보를 선정하고, < 아이보 (Aivo) > 의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.

                        2. 파기방법

                        전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다
                        
                        제5조(정보주체와 법정대리인의 권리·의무 및 그 행사방법에 관한 사항)

                        ① 정보주체는 아이보에 대해 언제든지 개인정보 열람·정정·삭제·처리정지 요구 등의 권리를 행사할 수 있습니다.

                        ② 제1항에 따른 권리 행사는 아이보에 대해 「개인정보 보호법」 시행령 제41조제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 아이보은(는) 이에 대해 지체 없이 조치하겠습니다.

                        ③ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다.이 경우 “개인정보 처리 방법에 관한 고시(제2020-7호)” 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.

                        ④ 개인정보 열람 및 처리정지 요구는 「개인정보 보호법」 제35조 제4항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.

                        ⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.

                        ⑥ 아이보은(는) 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.

                        제6조(개인정보의 안전성 확보조치에 관한 사항)

                        < 아이보 (Aivo) >은(는) 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.

                        1. 내부관리계획의 수립 및 시행
                        개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.

                        2. 개인정보 취급 직원의 최소화 및 교육
                        개인정보를 취급하는 직원을 지정하고 담당자에 한정시켜 최소화 하여 개인정보를 관리하는 대책을 시행하고 있습니다.

                        3. 개인정보에 대한 접근 제한
                        개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.

                        제7조(개인정보를 자동으로 수집하는 장치의 설치·운영 및 그 거부에 관한 사항)

                        7. 개인정보 자동 수집 장치의 설치•운영 및 거부에 관한 사항
                        
                        [쿠키의 사용]
                        이용자 개개인에게 개인화되고 맞춤화된 서비스를 제공하기 위해서 회사는 이용자의 정보를 저장하고 수시로 불러오는 '쿠키(cookie)'를 사용합니다.
                        쿠키는 웹사이트를 운영하는데 이용되는 서버가 사용자의 브라우저에게 보내는 조그마한 데이터 꾸러미로 이용자 컴퓨터의 하드디스크에 저장됩니다.
                        
                        1)쿠키의 사용 목적
                        회원과 비회원의 접속 빈도나 방문 시간 등의 분석, 이용자의 취향과 관심분야의 파악 및 자취 추적, 각종 이벤트 참여 정도 및 방문 회수 파악 등을 통한 타겟 마케팅 및 개인 맞춤 서비스 제공
                        2)쿠키 설정 거부 방법
                        이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서, 이용자는 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다.
                        
                        * 설정방법 예(인터넷 익스플로러의 경우)
                        : 웹 브라우저 상단의 도구 > 인터넷 옵션 > 개인정보 (단, 쿠키 설치를 거부하였을 경우 웹사이트에서 로그인이 필요한 일부 서비스의 이용이 어려울 수 있습니다.)
                        [구글 Firebase Analytics 를 이용한 앱로그 분석]
                        구글 Firebase Analytics 를 활용해 이용자의 서비스 이용에 대한 분석이 이루어집니다.
                        이용자는 서비스 내에 해제기능을 통하여 구글 Firebase Analytics 이용을 거부할 수 있습니다.
                        
                        [구글 Firebase Crashlytics를 이용한 앱오류 분석]
                        회사는 구글에서 제공하는 앱 오류 분석 도구인 Firebase Crashlytics를 이용하고 있으며, 이 경우 앱 오류 정보외 개인을 식별할 수 있는 정보는 이용하지 않습니다. 이용자는 서비스 내에 해제기능을 통하여 Firebase Crashlytics 이용을 거부할 수 있습니다.
                        
                        [맞춤형 광고 제공]
                        이용자가 외부계정과 연결되어 외부 서비스 제공자의 서비스에 접근 할 경우, 해당 외부 서비스 제공자는 맞춤형 광고 제공을 위해 개인 식별이 불가능한 이용자의 단말기 정보(광고ID, 광고parameter)를 외부 서비스 회원 정보와 결합할 수 있습니다.

                        제8조(행태정보의 수집·이용·제공 및 거부 등에 관한 사항)

                        행태정보의 수집·이용·제공 및 거부등에 관한 사항

                        <개인정보처리자명>은(는) 온라인 맞춤형 광고 등을 위한 행태정보를 수집·이용·제공하지 않습니다.

                                  제9조(추가적인 이용·제공 판단기준)

                            < 아이보 (Aivo) > 은(는) ｢개인정보 보호법｣ 제15조제3항 및 제17조제4항에 따라 ｢개인정보 보호법 시행령｣ 제14조의2에 따른 사항을 고려하여 정보주체의 동의 없이 개인정보를 추가적으로 이용·제공할 수 있습니다. 이에 따라 < 아이보 (Aivo) > 가(이) 정보주체의 동의 없이 추가적인 이용·제공을 하기 위해서 다음과 같은 사항을 고려하였습니다.
                                  ▶ 개인정보를 추가적으로 이용·제공하려는 목적이 당초 수집 목적과 관련성이 있는지 여부

                                  ▶ 개인정보를 수집한 정황 또는 처리 관행에 비추어 볼 때 추가적인 이용·제공에 대한 예측 가능성이 있는지 여부

                                  ▶ 개인정보의 추가적인 이용·제공이 정보주체의 이익을 부당하게 침해하는지 여부

                                  ▶ 가명처리 또는 암호화 등 안전성 확보에 필요한 조치를 하였는지 여부

                                  ※ 추가적인 이용·제공 시 고려사항에 대한 판단기준은 사업자/단체 스스로 자율적으로 판단하여 작성·공개함

                                  제10조 (개인정보 보호책임자에 관한 사항)

                                  ① 아이보 (Aivo) 은(는) 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.

                                  ▶ 개인정보 보호책임자
                                  성명 :이한성
                                  직책 :없음
                                  직급 :없음
                                  연락처 :010-5698-0599, jkhanseong@gmail.com
                                  ※ 개인정보 보호 담당부서로 연결됩니다.

                                  ▶ 개인정보 보호 담당부서
                                  부서명 :없음
                                  담당자 :이한성
                                  연락처 :010-5698-0599, jkhanseong@gmail.com
                                  ② 정보주체께서는 아이보 (Aivo) 의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. 아이보 (Aivo) 은(는) 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.

                                  제11조(개인정보의 열람청구를 접수·처리하는 부서)
                                  정보주체는 ｢개인정보 보호법｣ 제35조에 따른 개인정보의 열람 청구를 아래의 부서에 할 수 있습니다.
                                  < 아이보 (Aivo) >은(는) 정보주체의 개인정보 열람청구가 신속하게 처리되도록 노력하겠습니다.

                                  제12조(정보주체의 권익침해에 대한 구제방법)

                                  정보주체는 개인정보침해로 인한 구제를 받기 위하여 개인정보분쟁조정위원회, 한국인터넷진흥원 개인정보침해신고센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의 신고, 상담에 대하여는 아래의 기관에 문의하시기 바랍니다.

                                  1. 개인정보분쟁조정위원회 : (국번없이) 1833-6972 (www.kopico.go.kr)
                                  2. 개인정보침해신고센터 : (국번없이) 118 (privacy.kisa.or.kr)
                                  3. 대검찰청 : (국번없이) 1301 (www.spo.go.kr)
                                  4. 경찰청 : (국번없이) 182 (ecrm.cyber.go.kr)

                                  「개인정보보호법」제35조(개인정보의 열람), 제36조(개인정보의 정정·삭제), 제37조(개인정보의 처리정지 등)의 규정에 의한 요구에 대 하여 공공기관의 장이 행한 처분 또는 부작위로 인하여 권리 또는 이익의 침해를 받은 자는 행정심판법이 정하는 바에 따라 행정심판을 청구할 수 있습니다.

                                  ※ 행정심판에 대해 자세한 사항은 중앙행정심판위원회(www.simpan.go.kr) 홈페이지를 참고하시기 바랍니다.

                                  제13조(개인정보 처리방침 변경)
                                  
                                  ① 이 개인정보처리방침은 2023년 7월 9부터 적용됩니다.
                                  ② 이전의 개인정보 처리방침은 아래에서 확인하실 수 있습니다.
                                  `}
            </main>
        </>
    );
};

export default PrivacyPage;
